{"pages":[{"title":"","text":"Welcome I can’t remember which version the blog is ,Giving up halfway is so annoyiny. Welcome to the world of Cool Guy！！Eventually I decide to record my daily life!! This time the man gives up half way is a dog About the blog Name is “Flipped”, oh I love the word. Domain is named after the first letter of the Kana”ShikanoYuta”(Thinking of a name is so hard). However, I now find that the domain is strange and hard to remember isn’t it. Anyway—— Here comes the wonderful life of Cool Guy! Included but not limited： recode some articles of great shot Write primary school composition in Japanese A few source code Daily negativity Local Download Wait for exploring About Cool Guy To err is human, to forgive, divine. Actually, the Kanji of ShikanoYuta is “鹿野佑太”👍（But I have forgotten cuz long time no use. Really COOL AND HANDSOME Came from a distant Unknown Planet QQ:2635313260 Weibo:@_文藝青年 Github、Twtter and Facebook are in the Side Bar√ To resolve the server in China mainland, I have to put it on records, but I haven’t grown into 18 years old, hence only using Github Pages. While I don’t know whether it is stable. (Is there a single person that visit my website except me?) This article is also available in 中文, 日本語.","link":"/about/index-English.html"},{"title":"","text":"关于—— 这是不知道第几个版本的Blog了，我 恨 烂 尾。 欢迎来到花花酷盖的世界！！终于又决定要记录生活了吗！！ 这次谁再烂尾谁是狗 关于Blog 名字的话用了很喜欢的Flipped，我 爱 怦 然 心 动 域名是根据ShikanoYuta每个假名首字母得来的（因为真的好难想名字啊） 但是现在发现这域名好奇怪而且还不好记（？ 不管了—— 话说回来，这里被用来记录酷盖的滋润生活！ 包括但不限于： 码了亿点点大佬的文章 用日语写小学作文 关于一点点菜鸡的源码 日常负能 用作本地下载 待开发 关于酷盖 宽和慈善，不杵于物，进退沉浮，自得而已。 其实ShikanoYuta的汉字是鹿野佑太👍（虽然太久没用自己都忘了 真的很酷 还帅 来自一颗遥远的未知行星 QQ:2635313260 微博:@_文藝青年 Github、Twtter和Facebook的话在侧边栏有√ 还有就是因为国内的服务器域名解析需要备案，我居然还没满18岁（泪），所以只能用GithubPages了，也不知道访问速度咋样，可能 经常 打不开（但是除了我真的会有人打开吗） 本文同时提供以下语言的翻译: 日本語、 English。","link":"/about/index.html"},{"title":"","text":"ようこそへ こちらは何バージョンのブログが覚えない、中途に諦めることが大変。 かっこい世界にいらっしゃいませ！！やっとまだ生活を記録することを決めましたか！ 今回、誰が中途に諦めたら、誰が犬だ ブログについて 名前なら、大好きな「Flipped」を使って。 ドメインは鹿野祐太の仮名の頭字を取り組みきたと言う名前でーす でも、今このドメインはおかしくて覚えにくいと見つけた（涙） なんとしてもー こちらがイケメンの充実な生活を聞き取ることっていうか 含むけど、限らないオプション： アニギの文章を記録 日本語で小学校の作文を写す ちっと弱いソースコードを記録 日常消極気持ちを発散 ダウンロードサイトになって 開発に待ち イケメンについて 花が咲き、花が散る、繰り返しの繰り返し、生きながらえてきたが、今昔は昨日ではない。 実はShikanoYutaの漢字が鹿野佑太👍（長すぎ使わずから自分が忘れちゃったけれども ホントウクール 並びにかっこいい ある遠い未知な星から来ていました QQ:2635313260 Weibo:@_文藝青年 Github、TwtterやFacebookならサイトバーにあるよ√ 国内のサーバならドメインが解析したら、控えってことが必要ですけど、十八歳がまだ未満（涙）、ですからGithubPagesをしか使いません，訪問速度はどうかまだ知らないし，時々開けないだと考えて。（でも僕しか他の人は開くことの可能性があるのか） この文章も 中文、 Englishで可用です。","link":"/about/index-Japanese.html"}],"posts":[{"title":"Markdown语法","text":"码了一点点的Markdown的语法 一、标题在想要设置为标题的文字前面加#来表示一个#是一级标题，二个#是二级标题，以此类推。支持六级标题。 注：标准语法一般在#后跟个空格再写文字，貌似简书不加空格也行。 示例： 123456# 这是一级标题## 这是二级标题### 这是三级标题#### 这是四级标题##### 这是五级标题###### 这是六级标题 效果如下： 这是一级标题这是二级标题这是三级标题这是四级标题这是五级标题这是六级标题 二、字体 加粗 要加粗的文字左右分别用两个*号包起来 斜体 要倾斜的文字左右分别用一个*号包起来 斜体加粗 要倾斜和加粗的文字左右分别用三个*号包起来 删除线 要加删除线的文字左右分别用两个~~号包起来 示例： 1234**这是加粗的文字***这是倾斜的文字*`***这是斜体加粗的文字***~~这是加删除线的文字~~ 效果如下： 这是加粗的文字这是倾斜的文字这是斜体加粗的文字\\这是加删除线的文字 三、引用在引用的文字前加&gt;即可。引用也可以嵌套，如加两个&gt;&gt;三个&gt;&gt;&gt; n个…貌似可以一直加下去，但没神马卵用 示例： 123&gt;这是引用的内容&gt;&gt;这是引用的内容&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;这是引用的内容 效果如下： 这是引用的内容 这是引用的内容 这是引用的内容 四、分割线三个或者三个以上的 - 或者 * 都可以。 示例： 1234-------******** 效果如下：可以看到，显示效果是一样的。 五、图片语法： 1234![图片alt](图片地址 ''图片title'')图片alt就是显示在图片下面的文字，相当于对图片内容的解释。图片title是图片的标题，当鼠标移到图片上时显示的内容。title可加可不加 示例： 12![blockchain](https://ss0.bdstatic.com/70cFvHSh_Q1YnxGkpoWK1HF6hhy/it/u=702257389,1274025419&amp;fm=27&amp;gp=0.jpg &quot;区块链&quot;) 效果如下： img blockchain 上传本地图片直接点击导航栏的图片标志，选择图片即可 markdown格式追求的是简单、多平台统一。那么图片的存储就是一个问题，需要用图床，提供统一的外链，这样就不用在不同的平台去处理图片的问题了。才能做到书写一次，各处使用。关于图床的选择我写了一篇文章，对网上存在的各种方法做了总结，需要的朋友可以看看。markdown图床 六、超链接语法： 12[超链接名](超链接地址 &quot;超链接title&quot;)title可加可不加 示例： 12[简书](http://jianshu.com)[百度](http://baidu.com) 效果如下： 简书百度 注：Markdown本身语法不支持链接在新页面中打开，貌似简书做了处理，是可以的。别的平台可能就不行了，如果想要在新页面中打开的话可以用html语言的a标签代替。 1234&lt;a href=&quot;超链接地址&quot; target=&quot;_blank&quot;&gt;超链接名&lt;/a&gt;示例&lt;a href=&quot;https://www.jianshu.com/u/1f5ac0cf6a8b&quot; target=&quot;_blank&quot;&gt;简书&lt;/a&gt; 七、列表无序列表语法：无序列表用 - + * 任何一种都可以 12345- 列表内容+ 列表内容* 列表内容注意：- + * 跟内容之间都要有一个空格 效果如下： 列表内容 列表内容 列表内容 有序列表语法：数字加点 123451. 列表内容2. 列表内容3. 列表内容注意：序号跟内容之间要有空格 效果如下： 列表内容 列表内容 列表内容 列表嵌套上一级和下一级之间敲三个空格即可 一级无序列表内容 二级无序列表内容 二级无序列表内容 二级无序列表内容 一级无序列表内容 二级有序列表内容 二级有序列表内容 二级有序列表内容 一级有序列表内容 二级无序列表内容 二级无序列表内容 二级无序列表内容 一级有序列表内容 二级有序列表内容 二级有序列表内容 二级有序列表内容 八、表格语法： 1234567891011表头|表头|表头---|:--:|---:内容|内容|内容内容|内容|内容第二行分割表头和内容。- 有一个就行，为了对齐，多加了几个文字默认居左-两边加：表示文字居中-右边加：表示文字居右注：原生的语法两边都要用 | 包起来。此处省略 示例： 12345姓名|技能|排行--|:--:|--:刘备|哭|大哥关羽|打|二哥张飞|骂|三弟 效果如下： 姓名 技能 排行 刘备 哭 大哥 关羽 打 二哥 张飞 骂 三弟 九、代码语法：单行代码：代码之间分别用一个反引号包起来 1`代码内容` 代码块：代码之间分别用三个反引号包起来，且两边的反引号单独占一行 12345(```) 代码... 代码... 代码...(```) 注：为了防止转译，前后三个反引号处加了小括号，实际是没有的。这里只是用来演示，实际中去掉两边小括号即可。 示例： 单行代码 1`create database hero;` 代码块 123456(```) function fun(){ echo &quot;这是一句非常牛逼的代码&quot;; } fun();(```) 效果如下： 单行代码 1create database hero; 代码块 1234function fun(){ echo &quot;这是一句非常牛逼的代码&quot;;}fun(); 十、本地下载语法 1[下载内容](/download/文件名) 作者：高鸿祥链接：https://www.jianshu.com/p/191d1e21f7ed来源：简书著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。","link":"/uncategorized/Markdown%E8%AF%AD%E6%B3%95/"},{"title":"頭に突然込んだまま造語","text":"造語（ぞうご）は、新たに語（単語）を造ることや、既存の語を組み合わせて新たな意味の語を造ること、また、そうして造られた語である。新たに造られた語については、新語または新造語とも呼ばれる。 ​ 昔からいつもこの企画があるんけど、自分の言語を作ろうと思い、最近から真面目にやろうということを決めました。まっ始まるときから一大問題があって、それが読み方や書き方またはアルファベットを確定すること。自分が外で「フランス語を勉強しているよ、すごくわかっちゃったよねー」という、実は全然そんなことがないである。まだ、ゲルマン語系の発音や文字を選んだ、（興味あるから）。そして、IPA（って国際音標表）を調べて勉強し始めた。発音がヤッパリむずかしいね。特にたくさんの音標の発音が似てる。 て、「大舌音」と言うおとが出来ない、「小舌音」は一生懸命に勉強するあとで、成功したのに。サスガ俺！！！！！諦めぬ！それが一つだけ今回の冬休みの要望だろうね。じゃー、頑張ろ！！！ 2020/2/15に更新：諦めてしまいました","link":"/%E6%97%A5%E6%9C%AC%E8%AA%9E/%E9%80%A0%E8%AF%AD/"}],"tags":[{"name":"一点点码的东西","slug":"一点点码的东西","link":"/tags/%E4%B8%80%E7%82%B9%E7%82%B9%E7%A0%81%E7%9A%84%E4%B8%9C%E8%A5%BF/"},{"name":"随记","slug":"随记","link":"/tags/%E9%9A%8F%E8%AE%B0/"}],"categories":[{"name":"日本語","slug":"日本語","link":"/categories/%E6%97%A5%E6%9C%AC%E8%AA%9E/"}]}